#language: ru

Функционал: Поиск электроники

  Сценарий: Выбор Телевизора

    Когда выбран пункт меню Маркет
    Тогда выбран раздел Электроника и подраздел Телевизоры

    Когда выбрано число товаров на странице 12
    И выбрано отображение списком
    Тогда нажата кнопка Перейти ко всем фильтрам

    Когда выбрана цена от 20000
    И выбран производитель Samsung
    И выбран производитель LG
    Тогда нажата кнопка Показать подходящие

    Когда проверено ,что элементов 12
    И найден первый товар
    Тогда выполнена проверка


  Сценарий: Выбор наушников

    Когда выбран пункт меню Маркет
    Тогда выбран раздел Электроника и подраздел Наушники

    Когда выбрано число товаров на странице 12
    И выбрано отображение списком
    Тогда нажата кнопка Перейти ко всем фильтрам

    Когда выбрана цена от 5000
    И выбран производитель Beats
    Тогда нажата кнопка Показать подходящие

    Когда проверено ,что элементов 12
    И найден первый товар
    Тогда выполнена проверка




